[
    {
        "name": "Crock Pot Roast",
        "ctext": "Amazing flavor, and so simple! No salt needed here. This recipe is to die for with all the richness in flavors. Serve some of this tenderness to your guest this coming holiday!",
        "time": "9 hours and 5 minutes",
        "serving": "8 servings",
        "imageURL": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/27/20/8/picVfzLZo.jpg",
        "ingredients": [
            {
                "quantity": "1",
                "name": "beef roast",
                "type": "Protein"
            },
            {
                "quantity": "1 package",
                "name": "gravy",
                "type": "Condiments"
            },
            {
                "quantity": "1 package",
                "name": "dried Italian dressing",
                "type": "Condiments"
            },
            {
                "quantity": "1 package",
                "name": "dry ranch dressing",
                "type": "Condiments"
            }
        ],
        "steps": [
            "Place beef roast in crock pot.",
            "Mix the dried mixes together in a bowl and sprinkle over the roast.",
            "Pour the water around the roast.",
            "Cook on low for 7-9 hours."
        ]
    },
    {
        "name": "Roasted Asparagus",
        "ctext": "Look no further for the most simple and easy way to cook your asparagus! Quick, but also full of flavor, your asparagus will be off the plate in no time!",
        "time": "25 minutes",
        "serving": "4 servings",
        "imageURL": "http://img.sndimg.com/food/image/upload/w_266/v1/img/recipes/50/84/7/picMcSyVd.jpg",
        "ingredients": [
            {
                "quantity": "1 lb",
                "name": "asparagus",
                "type": "Produce"
            },
            {
                "quantity": "1 1/2 tbsp",
                "name": "olive oil",
                "type": "Condiments"
            }
        ],
        "steps": [
            "Preheat oven to 425°F.",
            "Cut off the woody bottom part of the asparagus spears and discard.",
            "With a vegetable peeler, peel off the skin on the bottom 2-3 inches of the spears (this keeps the asparagus from being all.\",string.\", and if you eat asparagus you know what I mean by that).",
            "Place asparagus on foil-lined baking sheet and drizzle with olive oil.",
            "Sprinkle with salt.",
            "With your hands, roll the asparagus around until they are evenly coated with oil and salt.",
            "Roast for 10-15 minutes, depending on the thickness of your stalks and how tender you like them.",
            "They should be tender when pierced with the tip of a knife.",
            "The tips of the spears will get very brown but watch them to prevent burning.",
            "They are great plain, but sometimes I serve them with a light vinaigrette if we need something acidic to balance out our meal."
        ]
    },
    {
        "name": "Curried Chicken Salad",
        "ctext": "Take dinner outside with this simple and fresh picnic supper. Pair with a light chardonnay to complement the curry and mango.",
        "time": "40 minutes",
        "serving": "6 servings",
        "imageURL": "http://www.chatelaine.com/wp-content/uploads/2013/05/Curried-chicken-salad.jpg",
        "ingredients": [
            {
                "quantity": "3",
                "name": "chicken breast",
                "type": "Protein"
            },
            {
                "quantity": "1/2 cup",
                "name": "mayonnaise",
                "type": "Condiments"
            },
            {
                "quantity": "1 tbsp",
                "name": "lemon zest",
                "type": "Produce"
            },
            {
                "quantity": "1 tbsp",
                "name": "lemon juice",
                "type": "Condiments"
            },
            {
                "quantity": "1 1/2 tsp",
                "name": "curry powder",
                "type": "Condiments"
            },
            {
                "quantity": "2",
                "name": "mango",
                "type": "Produce"
            },
            {
                "quantity": "1/4 cup",
                "name": "dried cranberries",
                "type": "Produce"
            },
            {
                "quantity": "2",
                "name": "green onion",
                "type": "Produce"
            },
            {
                "quantity": "1",
                "name": "celery",
                "type": "Produce"
            },
            {
                "quantity": "6 leaves",
                "name": "lettuce",
                "type": "Produce"
            },
            {
                "quantity": "6",
                "name": "english muffins",
                "type": "Misc"
            }
        ],
        "steps": [
            "Arrange chicken in a single layer in a large pot.",
            "Add water to just cover.",
            "Bring to a boil over medium-high.",
            "Flip chicken, reduce heat to medium and simmer until cooked, about 6 more min.",
            "Cool.",
            "STIR mayo with lemon zest, juice, curry and salt in large bowl.",
            "Using 2 forks, shred chicken, then stir into mayo mixture with mango, cranberries, green onions and celery.",
            "Divide among muffins with lettuce leaves",
            "Sandwich with tops"
        ]
    },
    {
        "name": "Healthy Breakfast Egg Muffins",
        "ctext": "Egg muffins are a healthy, easy, on-the-go breakfast. They are filling, low-carb, and perfect for meal prepping. Just switch up a few simple veggie and protein ingredients to create delicious combos that will last you through the week!",
        "time": "40 minutes",
        "serving": "12 servings",
        "imageURL": "static/Muffins.jpg",
        "ingredients": [
            {
                "quantity": "12",
                "name": "egg",
                "type": "Protien"
            },
            {
                "quantity": "4 cups",
                "name": "broccoli",
                "type": "Produce"
            },
            {
                "quantity": "3 slices",
                "name": "bacon",
                "type": "Protien"
            },
            {
                "quantity": "1 cup",
                "name": "cheese",
                "type": "Dairy"
            },
            {
                "quantity": "1/4 cup",
                "name": "chives",
                "type": "Produce"
            }
        ],
        "steps": [
            "Add the 12 eggs to a large 4-cup measuring cup and season with salt and pepper. Whisk the eggs until fluffy.",
            "Slice the bacon into 1/2-inch thick pieces. Add to a saute pan over medium heat, stirring frequently and cook until crispy. Use a slotted spoon to remove the bacon to a paper towel.",
            "Fill a pot with 1-inch of water and bring it to a boil. Insert a steamer basket, then add the broccoli florets. Cover with a lid and cook for 5-6 minutes. Remove the steamer basket and broccoli, and let cool for a couple of minutes. Then dice the broccoli into small pieces.",
            "Fill the muffin tray about 1/2 full with pieces of broccoli, bacon, and cheddar cheese. Sprinkle with chives. Then fill with egg mixture about 90% full and bake at 350F for 20-25 minutes.",
            "Let the muffins cool slightly, then run a knife along the outer edge and remove each egg muffin. Enjoy immediately or store in the fridge or freezer."
        ]
    },
    {
        "name": "Perfect Poached Eggs",
        "ctext":
            "Poached eggs are a beautiful thing. The whites are just firm enough on the outside to contain an oozy, golden yolk in a round little egg package. And with a few tips, you too can learn how to poach an egg perfectly every time!",
            "time": "8 minutes",
            "serving": "1 serving",
            "imageURL": "static/poached.jpg",
            "ingredients": [
            {
                "quantity": "1",
                "name": "egg",
                "type": "Protien"
            },
            {
                "quantity": "2 tbsp",
                "name": "vinegar",
                "type": "Condiments"
            }
        ],
        "steps": [
            "Bring a large pot of water to a boil, then reduce the heat to low.",
            "While waiting for the water to boil, crack an egg into a small fine mesh sieve over a bowl. Swirl the egg in the sieve until all the liquidy egg whites have been removed. Then, place the egg in a ramekin.",
            "Stir the vinegar into the water and create a vortex. Add the egg to the middle of the vortex and cook the egg for 3 minutes",
            "Remove the egg with a slotted spoon and dab it on a paper towel to remove any excess water. Serve immediately.",
            "Alternatively, if making the poached eggs for meal prep or ahead of time, transfer the cooked poached eggs to an ice water bath and refrigerate for a couple of days. When ready to serve, add boiling water to a bowl, then add the cold poached egg and submerge for 20-30 seconds or until warmed through. Remove the poached egg with a slotted spoon, dab dry and serve immediately."
        ]
    },
    {
        "name": "Creamy Avocado Egg Salad",
        "ctext":
            "Avocado egg salad takes your classic egg salad recipe and adds healthy avocado for a creamy, nutritious and tasty new recipe you’re sure to love. It’s paleo, whole30, low carb, keto and all around delicious.",
            "time": "25 minutes",
            "serving": "2 servings",
            "imageURL": "static/Salad.jpg",
            "ingredients": [
            {
                "quantity": "3",
                "name": "egg",
                "type": "Protein"
            },
            {
                "quantity": "1",
                "name": "avocado",
                "type": "Produce"
            },
            {
                "quantity": "2 tbsp",
                "name": "onion",
                "type": "Produce"
            },
            {
                "quantity": "2 tsp",
                "name": "mayonnaise",
                "type": "Condiments"
            },
            {
                "quantity": "1 tbsp",
                "name": "chives",
                "type": "Produce"
            },
            {
                "quantity": "1 tbsp",
                "name": "parsley",
                "type": "Produce"
            },
            {
                "quantity": "1 tsp",
                "name": "lemon juice",
                "type": "Condiments"
            },
            {
                "quantity": "3 leaves",
                "name": "lettuce",
                "type": "Produce"
            }
        ],
        "steps": [
            "Add all of the ingredients to a mixing bowl and stir to combine.",
            "Eat the avocado egg salad plain, topped on your favorite bread or on lettuce leaves."
        ]
    },
    {
        "name": "Smoked Salmon Deviled Egg",
        "ctext":
            "Smoked salmon deviled eggs take a classic appetizer (deviled eggs) to a stunning new level. Filled with fresh herbs, salty smoked salmon and briny capers, each bite is loaded with palate-pleasing flavor.",
            "time": "34 minutes",
            "serving": "12 servings",
            "imageURL": "static/Smoked.jpg",
            "ingredients": [
            {
                "quantity": "6",
                "name": "egg",
                "type": "Protein"
            },
            {
                "quantity": "3 tbsp",
                "name": "mayonnaise",
                "type": "Condiments"
            },
            {
                "quantity": "1 tbsp",
                "name": "shallot",
                "type": "Produce"
            },
            {
                "quantity": "1 tsp",
                "name": "mustard",
                "type": "Condiments"
            },
            {
                "quantity": "1 tsp",
                "name": "lemon juice",
                "type": "Condiments"
            },
            {
                "quantity": "1 tsp",
                "name": "dill",
                "type": "Produce"
            },
            {
                "quantity": "2 oz",
                "name": "smoked salmon",
                "type": "Protein"
            },
            {
                "quantity": "1 tbsp",
                "name": "capers",
                "type": "Produce"
            }
        ],
        "steps": [
            "Bring a pot of water to a boil, then reduce the heat to low to ensure the water is no longer boiling. Use a skimmer to place the eggs in the water. Then increase the heat back to high and set a timer for 14 minutes.",
            "While the eggs are boiling, prepare an ice water bath and set aside. After 14 minutes, remove the eggs from the water and place in the ice water bath to chill. Once the eggs have cooled completely, peel them and slice in half lengthwise.",
            "Scoop the yolks into a small bowl and place the egg whites on a serving plate.",
            "To make the filling, add the yolks, mayonnaise, dijon mustard, lemon juice, shallot, dill, salt and pepper to a bowl. Stir everything together until it's completely smooth.",
            "Use a spoon to add a portion of the deviled egg mixture back into the hole of each egg white. Then place a small piece of smoked salmon to top on each egg, along with a sprinkle of capers and fresh dill."
        ]
    }
]